<a href="https://colab.research.google.com/github/DaudaUmarFaruq2020/Demo/blob/master/HDSCLesson_1_code.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [2]:
DataPath= ("http://bit.ly/HDSC-Dataset")

In [3]:
Data=pd.read_csv(DataPath)

In [5]:
Data.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [6]:
Data.describe

<bound method NDFrame.describe of                      record_id  ...  fuel_cost_per_mmbtu
0        f1_fuel_1994_12_1_0_7  ...                1.121
1       f1_fuel_1994_12_1_0_10  ...                1.120
2        f1_fuel_1994_12_2_0_1  ...                1.650
3        f1_fuel_1994_12_2_0_7  ...                1.970
4       f1_fuel_1994_12_2_0_10  ...                2.570
...                        ...  ...                  ...
29518  f1_fuel_2018_12_12_0_13  ...                9.030
29519   f1_fuel_2018_12_12_1_1  ...                6.950
29520  f1_fuel_2018_12_12_1_10  ...                8.990
29521  f1_fuel_2018_12_12_1_13  ...                1.110
29522  f1_fuel_2018_12_12_1_14  ...               11.680

[29523 rows x 11 columns]>

In [7]:
Data.info

<bound method DataFrame.info of                      record_id  ...  fuel_cost_per_mmbtu
0        f1_fuel_1994_12_1_0_7  ...                1.121
1       f1_fuel_1994_12_1_0_10  ...                1.120
2        f1_fuel_1994_12_2_0_1  ...                1.650
3        f1_fuel_1994_12_2_0_7  ...                1.970
4       f1_fuel_1994_12_2_0_10  ...                2.570
...                        ...  ...                  ...
29518  f1_fuel_2018_12_12_0_13  ...                9.030
29519   f1_fuel_2018_12_12_1_1  ...                6.950
29520  f1_fuel_2018_12_12_1_10  ...                8.990
29521  f1_fuel_2018_12_12_1_13  ...                1.110
29522  f1_fuel_2018_12_12_1_14  ...               11.680

[29523 rows x 11 columns]>

In [18]:
DataC=Data["fuel_mmbtu_per_unit"]

In [20]:
DataC.std()

10.600220307806886

In [21]:
DataC.describe()

count    29523.000000
mean         8.492111
std         10.600220
min          0.000001
25%          1.024000
50%          5.762694
75%         17.006000
max        341.260000
Name: fuel_mmbtu_per_unit, dtype: float64

In [27]:
DataD=Data[["fuel_qty_burned","fuel_unit"]]

In [29]:
DataD.skew()

fuel_qty_burned    15.851495
dtype: float64

In [30]:
DataD.kurt()

fuel_qty_burned    651.36945
dtype: float64

In [33]:
Data.notnull()

       record_id  ...  fuel_cost_per_mmbtu
0           True  ...                 True
1           True  ...                 True
2           True  ...                 True
3           True  ...                 True
4           True  ...                 True
...          ...  ...                  ...
29518       True  ...                 True
29519       True  ...                 True
29520       True  ...                 True
29521       True  ...                 True
29522       True  ...                 True

[29523 rows x 11 columns]

In [40]:
Data[Data.notnull()]

                     record_id  ...  fuel_cost_per_mmbtu
0        f1_fuel_1994_12_1_0_7  ...                1.121
1       f1_fuel_1994_12_1_0_10  ...                1.120
2        f1_fuel_1994_12_2_0_1  ...                1.650
3        f1_fuel_1994_12_2_0_7  ...                1.970
4       f1_fuel_1994_12_2_0_10  ...                2.570
...                        ...  ...                  ...
29518  f1_fuel_2018_12_12_0_13  ...                9.030
29519   f1_fuel_2018_12_12_1_1  ...                6.950
29520  f1_fuel_2018_12_12_1_10  ...                8.990
29521  f1_fuel_2018_12_12_1_13  ...                1.110
29522  f1_fuel_2018_12_12_1_14  ...               11.680

[29523 rows x 11 columns]

In [41]:
Data.corr()

                              utility_id_ferc1  ...  fuel_cost_per_mmbtu
utility_id_ferc1                      1.000000  ...             0.006122
report_year                           0.093323  ...             0.010261
fuel_qty_burned                      -0.057447  ...            -0.001896
fuel_mmbtu_per_unit                  -0.066946  ...            -0.005884
fuel_cost_per_unit_burned            -0.037863  ...            -0.000437
fuel_cost_per_unit_delivered         -0.016414  ...            -0.000109
fuel_cost_per_mmbtu                   0.006122  ...             1.000000

[7 rows x 7 columns]

In [43]:
Data['fuel_cost_per_unit_delivered'].mean()

917.5704491074691

In [44]:
Data.iloc[2004]

record_id                       f1_fuel_1995_12_150_0_11
utility_id_ferc1                                     150
report_year                                         1995
plant_name_ferc1                           south whidbey
fuel_type_code_pudl                                  oil
fuel_unit                                            bbl
fuel_qty_burned                                     4244
fuel_mmbtu_per_unit                                5.922
fuel_cost_per_unit_burned                          30.88
fuel_cost_per_unit_delivered                           0
fuel_cost_per_mmbtu                                 5.21
Name: 2004, dtype: object